1s/ERP/Conf/Catalogs/Лико_ВерсииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_ВерсииНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Технология</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АртикулНоменклатуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТехнологияПечати</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ТехнологияПечати</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтарыйАртикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаменаНаВерсию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ВерсииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлСогласования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласовано</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_РегистрацияОперацийДляОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_РегистрацияОперацийДляОбмена</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>created_at</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>modified_at</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>status</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>listener</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>data</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>event</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>uuid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ТипыЭтикеток.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ТипыЭтикеток</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЭТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КЭ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кльр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пакет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неопределено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_ВерсииНоменклатуры/Ext/ManagerModule.bsl
Функция Settings() Экспорт
	Возврат Справочники.HTTPConnections.Settings(Справочники.HTTPСервисы.DFM);

	Структура = Новый Структура;
	Структура.Вставить("username","i-portal");
	Структура.Вставить("password","3457Qe!56785");
		
	Структура.Вставить("domain","dfm2.okil.ru");
	Структура.Вставить("ApiEndPoint_Send","api/v2/nodes/product");
    Структура.Вставить("usernameToken","i-portal");
	Структура.Вставить("passwordToken","3457Qe!56785");
    Структура.Вставить("ApiEndPoint_Token","api/v2/signin");
	Структура.Вставить("ApiEndPoint_mail","/api/v2/articles/appoint");

	
	
	Возврат Структура; 
КонецФункции

Функция СоздатьВерсиюНоменкатуры (Номенклатура,Версия) Экспорт//+Лико m.shenderov 26.04.2021  
	
	ВерсияНоменклатуры=Неопределено;
	Если  Версия<>Неопределено Тогда
		ВерсияНоменклатуры=НайтиВерсиюНоменклатуры(Номенклатура,Версия);
				
	КонецЕсли;
		
	 Если ВерсияНоменклатуры=Неопределено Тогда
		СпрОбъект =Справочники.Лико_ВерсииНоменклатуры.СоздатьЭлемент();
	Иначе
		СпрОбъект =ВерсияНоменклатуры.ПолучитьОбъект();	
	КонецЕсли;

	
	СпрОбъект.Номенклатура			=Номенклатура;
	СпрОбъект.АртикулНоменклатуры	=Номенклатура.Артикул;
	СпрОбъект.Версия				=?(Версия=Неопределено,ПолучитьНовуюВерсиюНоменклатуры(Номенклатура),Версия);
	СпрОбъект.Артикул               =СтрШаблон("%1-%2",СпрОбъект.АртикулНоменклатуры,Строка(СпрОбъект.Версия));
	
	СпрОбъект.Записать();
	
	Возврат СпрОбъект.Ссылка;
	
КонецФункции  //-Лико m.shenderov 26.04.2021

Функция СоздатьВерсиюНоменкатуры22012024 (Номенклатура,Технология,Версия) Экспорт//+Лико m.shenderov 26.04.2021  
	
	ВерсияНоменклатуры=Неопределено;
	Если  Версия<>Неопределено Тогда
		ВерсияНоменклатуры=НайтиВерсиюНоменклатуры(Номенклатура,Версия);
				
	КонецЕсли;
		
	 Если ВерсияНоменклатуры=Неопределено Тогда
		СпрОбъект =Справочники.Лико_ВерсииНоменклатуры.СоздатьЭлемент();
	Иначе
		СпрОбъект =ВерсияНоменклатуры.ПолучитьОбъект();	
	КонецЕсли;

	
	СпрОбъект.Номенклатура			=Номенклатура;
	СпрОбъект.АртикулНоменклатуры	=Номенклатура.Артикул;
	СпрОбъект.Версия				=?(Версия=Неопределено,ПолучитьНовуюВерсиюНоменклатуры(Номенклатура),Версия);
	СпрОбъект.Технология            =Технология.Код;
	СпрОбъект.ТехнологияПечати      =Технология;
	СпрОбъект.Артикул               =СтрШаблон("%1-%2-%3",СпрОбъект.АртикулНоменклатуры,Строка(СпрОбъект.Версия),Строка(Технология.Код));
	
	СпрОбъект.Записать();
	
	Возврат СпрОбъект.Ссылка;
	
КонецФункции  //-Лико m.shenderov 26.04.2021


Функция ПолучитьНовуюВерсиюНоменклатуры(Номенклатура) Экспорт //+Лико m.shenderov 26.04.2021
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ВерсииНоменклатуры.Версия КАК Версия
	|ИЗ
	|	Справочник.Лико_ВерсииНоменклатуры КАК Лико_ВерсииНоменклатуры
	|ГДЕ
	|	Лико_ВерсииНоменклатуры.Номенклатура = &Номенклатура
	|	И НЕ Лико_ВерсииНоменклатуры.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Версия УБЫВ";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Возврат Выборка.Версия+1;
		
	КонецЦикла; 	
	Возврат 0;	
КонецФункции //-Лико m.shenderov 26.04.2021 

Функция СоздатьНоменклатуру(НаименованиеНоменклатуры,ТипЭтикетки,Версия=Неопределено,Регион,Клиент,Менеджер,Дизайнер,DFM,Номенклатура=Неопределено,Артикул=Неопределено,СоздатьDFM=Истина,Заказ,Комментарий="") Экспорт
	Структура = Новый Структура;
	Структура.Вставить("Номенклатура");
	Структура.Вставить("Артикул");
	Структура.Вставить("Ошибка","");
	
	НовыйАртикул=ПолучитьАртикул();

	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	Если Номенклатура=Неопределено Тогда
		Если Артикул=Неопределено Тогда 
			Артикул       =НовыйАртикул;
		КонецЕсли;
		
		
		
		#Если ВнешнееСоединение Тогда
			
		#Иначе 
			// <-- Начало Лико Яцун С. В. 31.07.2025 
			Если ЗначениеЗаполнено(Заказ) Тогда
				ТипЗаказа = Заказ.ТипЗаказа;	
			Иначе
				ТипЗаказа = Неопределено;	
			КонецЕсли;
			// <-- Конец Лико Яцун С. В. 31.07.2025
			Номенклатура  =Лико_Планирование.СоздатьНоменклатуруНаСервере(НаименованиеНоменклатуры,ТипЭтикетки,Регион,Клиент,Артикул,DFM,ТипЗаказа);
		#КонецЕсли	
	КонецЕсли;
	Если ЗначениеЗаполнено(Номенклатура) И Не Номенклатура.Лико_DFM Тогда 
		СпрОбъект=Номенклатура.ПолучитьОбъект();
		СпрОбъект.Лико_DFM=Истина;
		СпрОбъект.Лико_АртикулСтарый=СпрОбъект.Артикул;
		СпрОбъект.Артикул=НовыйАртикул;
		СпрОбъект.Записать();
	КонецЕсли;
	
	ВерсияНоменклатуры=Справочники.Лико_ВерсииНоменклатуры.СоздатьВерсиюНоменкатуры(Номенклатура,Версия);
	Структура.Вставить("Версия",ВерсияНоменклатуры.Версия);
	Структура.Вставить("ВерсияНоменклатуры",ВерсияНоменклатуры);
	Артикул=ВерсияНоменклатуры.АртикулНоменклатуры;
	Если Не ОтправитьВDFM(ВерсияНоменклатуры,ТипЭтикетки,Регион,Клиент,Менеджер,Дизайнер,Заказ,Комментарий) Тогда
		ВызватьИсключение "Отправка версии номенклатуры в DFM не выполнена!";
	КонецЕсли;
	
		
	Если СоздатьDFM Тогда
		СоздатьНоменклатуруДфМ=СоздатьНоменклатуруВDFM(Клиент,ТипЭтикетки,Номенклатура,Версия,Менеджер,Дизайнер,Заказ,Комментарий);
	КонецЕсли;
	Структура.Номенклатура =Номенклатура;	
	Структура.Артикул      =Артикул;
	
	ЗафиксироватьТранзакцию();
	Возврат Структура;
	
КонецФункции

Функция СоздатьНоменклатуру22012014(НаименованиеНоменклатуры,ТипЭтикетки,Технология,Версия=Неопределено,Регион,Клиент,Менеджер,Дизайнер,DFM,Номенклатура=Неопределено,Артикул=Неопределено,СоздатьDFM=Истина,Заказ,Комментарий="") Экспорт
	Структура = Новый Структура;
	Структура.Вставить("Номенклатура");
	Структура.Вставить("Артикул");
	Структура.Вставить("Ошибка","");
	
	НовыйАртикул=ПолучитьАртикул();

	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	Если Номенклатура=Неопределено Тогда
		Если Артикул=Неопределено Тогда 
			Артикул       =НовыйАртикул;
		КонецЕсли;
		
		
		
		#Если ВнешнееСоединение Тогда
			
		#Иначе
			Номенклатура  =Лико_Планирование.СоздатьНоменклатуруНаСервере(НаименованиеНоменклатуры,ТипЭтикетки,Регион,Клиент,Артикул,DFM);
		#КонецЕсли	
	КонецЕсли;
	Если ЗначениеЗаполнено(Номенклатура) И Не Номенклатура.Лико_DFM Тогда 
		СпрОбъект=Номенклатура.ПолучитьОбъект();
		СпрОбъект.Лико_DFM=Истина;
		СпрОбъект.Лико_АртикулСтарый=СпрОбъект.Артикул;
		СпрОбъект.Артикул=НовыйАртикул;
		СпрОбъект.Записать();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Технология) Или ЗначениеЗаполнено(Версия) Тогда 
		ВерсияНоменклатуры=Справочники.Лико_ВерсииНоменклатуры.СоздатьВерсиюНоменкатуры(Номенклатура,Технология,Версия);
		Структура.Вставить("Версия",ВерсияНоменклатуры.Версия);
		Структура.Вставить("ВерсияНоменклатуры",ВерсияНоменклатуры);
		Артикул=ВерсияНоменклатуры.АртикулНоменклатуры;
		Если Не ОтправитьВDFM(ВерсияНоменклатуры,ТипЭтикетки,Регион,Клиент,Менеджер,Дизайнер,Заказ,Комментарий) Тогда
			ВызватьИсключение "Отправка версии номенклатуры в DFM не выполнена!";
		КонецЕсли;
		
		
	КонецЕсли;
	Если СоздатьDFM Тогда
		СоздатьНоменклатуруДфМ=СоздатьНоменклатуруВDFM(Клиент,ТипЭтикетки,Номенклатура,Версия,Менеджер,Дизайнер,Заказ,Комментарий);
	КонецЕсли;
	Структура.Номенклатура =Номенклатура;	
	Структура.Артикул      =Артикул;
	
	ЗафиксироватьТранзакцию();
	Возврат Структура;
	
КонецФункции


Функция ПолучитьАртикул() Экспорт //+Лико m.shenderov 28.04.2021
		
	УстановитьПривилегированныйРежим(Истина);
	СпрОбъект=Справочники.Лико_ПредопределенныеЗначения.счНоменклатураАртикул.ПолучитьОбъект();
	СпрОбъект.ЗначениеПараметра=СпрОбъект.ЗначениеПараметра+1;
	СпрОбъект.Записать();
	Возврат Формат(СпрОбъект.ЗначениеПараметра,"ЧЦ=8; ЧВН=; ЧГ="); 
КонецФункции //-Лико m.shenderov 28.04.2021 



Функция ОтправитьВDFM(ВерсияНоменклатуры,ТипЭтикетки,Регион,Клиент,Менеджер,Дизайнер,Заказ,Комментарий) //+Лико m.shenderov 05.05.2021
	Результат=Истина;
	Возврат  Результат;
КонецФункции //-Лико m.shenderov 05.05.2021 

Функция ПолучитьToken() //+Лико m.shenderov 07.05.2021
    	Settings= Справочники.HTTPConnections.Settings(Справочники.HTTPСервисы.DFM);

	//ЗаполнитьЗначенияСвойств(Структура,СоздаваемыйКонтрагент);
	//Settings=Settings();
	Структура = Новый Структура;
	//Структура.Вставить("username","i-portal");
	//Структура.Вставить("password","3457Qe!56785");
	Структура.Вставить("username",Settings.usernameToken);
	Структура.Вставить("password",Settings.passwordToken);

	НастройкиСериализациииJSON 							= Новый НастройкиСериализацииJSON;
	НастройкиСериализациииJSON.ВариантЗаписиДаты		= ВариантЗаписиДатыJSON.ЛокальнаяДата;
	НастройкиСериализациииJSON.ФорматСериализацииДаты 	= ФорматДатыJSON.ISO;
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();	
	ЗаписатьJSON(ЗаписьJSON, Структура,НастройкиСериализациииJSON); 	
	ТелоЗапроса = ЗаписьJSON.Закрыть(); 
	
	ssl = Новый ЗащищенноеСоединениеOpenSSL();
	
	
	////Попытка
	////	//СоединениеHTTP = Новый HTTPСоединение("192.168.11.140",8184,,,,,);
	////	СоединениеHTTP = Новый HTTPСоединение("dev-dfm.okil.ru",,,,,,ssl);
	////	
	////Исключение
	////	
	////КонецПопытки; 
	
	Попытка
		
		//HttpRespons=HttpRecuest("dev-dfm.okil.ru","api/v2/signin",ТелоЗапроса,ssl,);
		HttpRespons=HttpRecuest(Settings.domain,Settings.ApiEndPoint_Token,ТелоЗапроса,ssl,);

		ОтветПотокаJSON = ПолучитьОтветJSON(HttpRespons);		
		
		Если ОтветПотокаJSON.Свойство("token") Тогда 				
			Возврат  ОтветПотокаJSON.token;
		КонецЕсли;
	Исключение
		Сообщить(ОписаниеОшибки());
		ВызватьИсключение;
		Возврат Неопределено;

	КонецПопытки;

	
	//HTTPЗапрос = Новый HTTPЗапрос("api/v2/signin");
	//	HTTPЗапрос.Заголовки.Вставить("Content-type", "application/json; charset=utf-8");
	//HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	//
	//Попытка
	//	HTTPОтвет = СоединениеHTTP.ОтправитьДляОбработки(HTTPЗапрос);
	//	Ответ = HTTPОтвет.ПолучитьТелоКакСтроку();
	//Исключение
	//	Сообщить(ОписаниеОшибки());
	//	Возврат Неопределено;
	//КонецПопытки;
	//
	//
	//ПотокОтветаJSON  = HTTPОтвет.ПолучитьТелоКакПоток();
	//ЧтениеПотокаJSON = Новый ЧтениеJSON;
	//ЧтениеПотокаJSON.ОткрытьПоток(ПотокОтветаJSON, КодировкаТекста.UTF8);
	//ОтветПотокаJSON = ПрочитатьJSON(ЧтениеПотокаJSON);
	//Если ОтветПотокаJSON.Свойство("token") Тогда
	//	ЧтениеПотокаJSON.Закрыть();
	//	
	//	Возврат  ОтветПотокаJSON.token;
	//КонецЕсли;	
	//ЧтениеПотокаJSON.Закрыть();
	
	
	
КонецФункции //-Лико m.shenderov 07.05.2021 

Функция СоздатьНоменклатуруВDFM(Клиент,ТипЭтикетки,Номенклатура,Версия,Менеджер,Дизайнер,Заказ,Комментарий) Экспорт  //+Лико m.shenderov 07.05.2021
	Если НЕ Лико_Дополнительно.ПроверитьЭтоРабочаяБаза() Тогда
		// Это копия, письма отправлять не нужно
		//Сообщить("Это копия базы,номенклатура в DFM не создана!");
		//Возврат  Истина;
	КонецЕсли;
	
	Возврат РегистрацияСозданиеНоменклатурыВDFM(Клиент,ТипЭтикетки,Номенклатура,Версия,Менеджер,Дизайнер,Заказ,Комментарий);
	
КонецФункции //-Лико m.shenderov 07.05.2021 

Функция СоздатьНоменклатуруВDFM22012024(Клиент,ТипЭтикетки,Номенклатура,Технология,Версия,Менеджер,Дизайнер,Заказ,Комментарий) Экспорт  //+Лико m.shenderov 07.05.2021
	Если НЕ Лико_Дополнительно.ПроверитьЭтоРабочаяБаза() Тогда
		// Это копия, письма отправлять не нужно
		//Сообщить("Это копия базы,номенклатура в DFM не создана!");
		//Возврат  Истина;
	КонецЕсли;
	
	Возврат РегистрацияСозданиеНоменклатурыВDFM(Клиент,ТипЭтикетки,Номенклатура,Версия,Менеджер,Дизайнер,Заказ,Комментарий);
	
	Settings=Settings();
	Token=ПолучитьToken();
	Если Не ЗначениеЗаполнено(Token) Тогда
		ВызватьИсключениеПринудительно("token не получен." );
		Возврат Неопределено;
		
	КонецЕсли;
	
	//Почта=ПолучитьEmail(Менеджер);
	//	
	//
	//Структура = Новый Структура;
	//Структура.Вставить("op"               , "create");
	////Структура.Вставить("op"               , "test");
	//Структура.Вставить("initiator_type"   , "client");
	//Структура.Вставить("initiator_id"     , Клиент.Код);
	//Структура.Вставить("product_type_id"  , Перечисления.Лико_ТипыЭтикеток.Индекс(ТипЭтикетки)+1);
	//Структура.Вставить("product_name"     , Номенклатура.Наименование);
	//Структура.Вставить("technology_number", Технология.Код);
	//Структура.Вставить("product_article"  , Строка(Номенклатура.Артикул));
	//Структура.Вставить("product_code"     , Строка(Номенклатура.УникальныйИдентификатор()));
	//Структура.Вставить("version_number"   , Версия);
	////Структура.Вставить("author_name"   , ПараметрыСеанса.ТекущийПользователь.Наименование);
	////Структура.Вставить("author_mail"   , ПолучитьEmail(ПараметрыСеанса.ТекущийПользователь));
	//Структура.Вставить("author_name"   , Менеджер.Наименование);
	//Структура.Вставить("author_mail"   , Почта);
	//

	//Структура.Вставить("order_number"  , Заказ.Номер);
	//Структура.Вставить("order_time"   , Заказ.Дата); 

	//
	//Если НЕ ЗначениеЗаполнено(Почта) Тогда
	//	ОтправитьУведомлениеИТDFM(Структура);
	//КонецЕсли;


	//
	//recipients = Новый Массив();
	//recipients.Добавить(ПолучитьEmail(Дизайнер));
	//notification = Новый Структура;
	//notification.Вставить("send"      ,1);
	//notification.Вставить("text"      ,Комментарий);
	//notification.Вставить("recipients",recipients);	
	//
	//Структура.Вставить("notification", СтруктураВJSON(notification)); 	
	//ТелоЗапроса=СтруктураВJSON(Структура);
	
	ТелоЗапроса=НоменклатураDFM_JSON(Клиент,ТипЭтикетки,Номенклатура,Версия,Менеджер,Дизайнер,Заказ,Комментарий);
	
	ssl = Новый ЗащищенноеСоединениеOpenSSL();
	
	
	Попытка		
		//СоединениеHTTP = Новый HTTPСоединение("dfm2.okil.ru",,,,,,ssl); 	
		Массив = Новый Массив();
		Массив.Добавить(Новый Структура("Authorization", СтрШаблон("Bearer %1",Token)));
		Массив.Добавить(Новый Структура("UserRole", "_service"));

		//HttpRespons=HttpRecuest("dev-dfm.okil.ru","api/v2/nodes/product",ТелоЗапроса,ssl,,Массив);
		HttpRespons=HttpRecuest(Settings.domain,Settings.ApiEndPoint_Send,ТелоЗапроса,ssl,,Массив);

		ОтветПотокаJSON = ПолучитьОтветJSON(HttpRespons);		
		
		Если ОтветПотокаJSON.Свойство("id") Тогда 				
			Возврат  ОтветПотокаJSON.id;
		КонецЕсли;
		
	Исключение
		Сообщить(ОписаниеОшибки());
		ВызватьИсключение;
		Возврат Неопределено;
	КонецПопытки;	
КонецФункции //-Лико m.shenderov 07.05.2021 


Функция РегистрацияСозданиеНоменклатурыВDFM(Клиент,ТипЭтикетки,Номенклатура,Версия,Менеджер,Дизайнер,Заказ,Комментарий) Экспорт  //+Лико m.shenderov 07.05.2021
	
	Если НЕ Лико_Дополнительно.ПроверитьЭтоРабочаяБаза() Тогда
		// Это копия, письма отправлять не нужно
		//Сообщить("Это копия базы,номенклатура в DFM не создана!");
		//Возврат  Истина;
	КонецЕсли;
	DataJson=НоменклатураDFM_JSON(Клиент,ТипЭтикетки,Номенклатура,Версия,Менеджер,Дизайнер,Заказ,Комментарий);
	Возврат РегистрыСведений.Лико_РегистрацияОперацийДляОбмена.ДобавитьСобытие(,,DataJson);
	
	ТипыСобытий=ТипыСобытийОбмена();
	
	uuid = Строка(Новый УникальныйИдентификатор);		
	
	НаборЗаписей = РегистрыСведений.Лико_РегистрацияОперацийДляОбмена.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.uuid.Установить(uuid);
	
	Запись=НаборЗаписей.Добавить();
	Запись.uuid=uuid;
	Запись.created_at=ТекущаяДата();
	Запись.listener="dfm";  
	Запись.event=ТипыСобытий.СозданиеНоменклатуры;
    Запись.data=НоменклатураDFM_JSON(Клиент,ТипЭтикетки,Номенклатура,Версия,Менеджер,Дизайнер,Заказ,Комментарий);
    НаборЗаписей.Записать(Истина);
   Возврат uuid;

КонецФункции //-Лико m.shenderov 07.05.2021 

Функция РегистрацияСозданиеНоменклатурыВDFM22012024(Клиент,ТипЭтикетки,Номенклатура,Технология,Версия,Менеджер,Дизайнер,Заказ,Комментарий) Экспорт  //+Лико m.shenderov 07.05.2021
	Если НЕ Лико_Дополнительно.ПроверитьЭтоРабочаяБаза() Тогда
		// Это копия, письма отправлять не нужно
		//Сообщить("Это копия базы,номенклатура в DFM не создана!");
		//Возврат  Истина;
    КонецЕсли;
	
	ТипыСобытий=ТипыСобытийОбмена();
	
	uuid = Строка(Новый УникальныйИдентификатор);		
	
	НаборЗаписей = РегистрыСведений.Лико_РегистрацияОперацийДляОбмена.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.uuid.Установить(uuid);
	
	Запись=НаборЗаписей.Добавить();
	Запись.uuid=uuid;
	Запись.created_at=ТекущаяДата();
	Запись.listener="dfm";  
	Запись.event=ТипыСобытий.СозданиеНоменклатуры;
    Запись.data=НоменклатураDFM_JSON(Клиент,ТипЭтикетки,Номенклатура,Версия,Менеджер,Дизайнер,Заказ,Комментарий);
    НаборЗаписей.Записать(Истина);
   Возврат uuid;

КонецФункции //-Лико m.shenderov 07.05.2021 


Функция ТипыСобытийОбмена() //+Лико m.shenderov 09.01.2024
	
	Возврат РегистрыСведений.Лико_РегистрацияОперацийДляОбмена.ТипыСобытийОбмена();
	
	//Структура = Новый Структура;
	//Структура.Вставить("СозданиеНоменклатуры","create_article");
	//Возврат Структура;
КонецФункции //-Лико m.shenderov 09.01.2024 


Функция НоменклатураDFM_JSON(Клиент,ТипЭтикетки,Номенклатура,Версия,Менеджер,Дизайнер,Заказ,Комментарий) Экспорт  //+Лико m.shenderov 07.05.2021
	
	
	
	Почта=ПолучитьEmail(Менеджер);
		
	
	Структура = Новый Структура;
	Структура.Вставить("op"               , "create");
	Структура.Вставить("initiator_type"   , "client");
	Структура.Вставить("initiator_id"     , Клиент.Код);
	Структура.Вставить("product_type_id"  , Перечисления.Лико_ТипыЭтикеток.Индекс(ТипЭтикетки)+1);
	Структура.Вставить("product_name"     , Номенклатура.Наименование);
	Структура.Вставить("product_article"  , Строка(Номенклатура.Артикул));
	Структура.Вставить("product_code"     , Строка(Номенклатура.УникальныйИдентификатор()));
	Структура.Вставить("version_number"   , Версия);
	Структура.Вставить("author_name"   	  , Менеджер.Наименование);
    Структура.Вставить("author_mail"      , Почта);
	Структура.Вставить("order_number"     , Заказ.Номер);
    Структура.Вставить("order_time"       , Заказ.Дата);
	Структура.Вставить("nom_code "        , Номенклатура.Код);
	Структура.Вставить("cust_label_code " , КодЭтикеткиЗаказчика(Заказ,Номенклатура));
    
	
	Если НЕ ЗначениеЗаполнено(Почта) Тогда
		ОтправитьУведомлениеИТDFM(Структура);
	КонецЕсли;


	
	recipients = Новый Массив();
	recipients.Добавить(ПолучитьEmail(Дизайнер));
	notification = Новый Структура;
	notification.Вставить("send"      ,1);
	notification.Вставить("text"      ,Комментарий);
	notification.Вставить("recipients",recipients);	
	
	Структура.Вставить("notification", СтруктураВJSON(notification)); 	
	ТелоЗапроса=СтруктураВJSON(Структура);
	
	
	Возврат СтруктураВJSON(Структура);
	
КонецФункции //-Лико m.shenderov 07.05.2021 

Функция НоменклатураDFM_JSON22012024(Клиент,ТипЭтикетки,Номенклатура,Технология,Версия,Менеджер,Дизайнер,Заказ,Комментарий) Экспорт  //+Лико m.shenderov 07.05.2021
	
	
	
	Почта=ПолучитьEmail(Менеджер);
		
	
	Структура = Новый Структура;
	Структура.Вставить("op"               , "create");
	Структура.Вставить("initiator_type"   , "client");
	Структура.Вставить("initiator_id"     , Клиент.Код);
	Структура.Вставить("product_type_id"  , Перечисления.Лико_ТипыЭтикеток.Индекс(ТипЭтикетки)+1);
	Структура.Вставить("product_name"     , Номенклатура.Наименование);
	Структура.Вставить("technology_number", Технология.Код);
	Структура.Вставить("product_article"  , Строка(Номенклатура.Артикул));
	Структура.Вставить("product_code"     , Строка(Номенклатура.УникальныйИдентификатор()));
	Структура.Вставить("version_number"   , Версия);
	Структура.Вставить("author_name"   	  , Менеджер.Наименование);
    Структура.Вставить("author_mail"      , Почта);
	Структура.Вставить("order_number"     , Заказ.Номер);
    Структура.Вставить("order_time"       , Заказ.Дата); 

	
	Если НЕ ЗначениеЗаполнено(Почта) Тогда
		ОтправитьУведомлениеИТDFM(Структура);
	КонецЕсли;


	
	recipients = Новый Массив();
	recipients.Добавить(ПолучитьEmail(Дизайнер));
	notification = Новый Структура;
	notification.Вставить("send"      ,1);
	notification.Вставить("text"      ,Комментарий);
	notification.Вставить("recipients",recipients);	
	
	Структура.Вставить("notification", СтруктураВJSON(notification)); 	
	ТелоЗапроса=СтруктураВJSON(Структура);
	
	
	Возврат СтруктураВJSON(Структура);
	
КонецФункции //-Лико m.shenderov 07.05.2021 

Функция КодЭтикеткиЗаказчика(Заказ,Номенклатура) 
	//Заказ = Документы.ЗаказКлиента.НайтиПоНомеру();
	Результат = "";
	
	  НайденныеСтроки = Заказ.Товары.НайтиСтроки(Новый Структура("Номенклатура",Номенклатура));
	  
	  Для каждого СтрТовар Из НайденныеСтроки  Цикл
	  	  Возврат СтрТовар.КодЭтикеткиЗаказчика;
	  КонецЦикла;
	
	Возврат Результат;
КонецФункции  



Функция ОтправитьУведомлениеВDFM(МассивВерсий, Дизайнер, Заказ, Комментарий) Экспорт 
	
	DataJson=АдаптерУведомленияВDFM(МассивВерсий, Дизайнер, Заказ, Комментарий);
	Возврат РегистрыСведений.Лико_РегистрацияОперацийДляОбмена.ДобавитьСобытие(,"ОтправитьСообщение",DataJson);

КонецФункции

Функция АдаптерУведомленияВDFM(МассивВерсий, Дизайнер, Заказ, Комментарий) //+Лико m.shenderov 05.02.2024
	
	Структура = Новый Структура;
	Структура.Вставить("author_name"   , ПараметрыСеанса.ТекущийПользователь.Наименование);
	Структура.Вставить("author_mail"   , ПолучитьEmail(ПараметрыСеанса.ТекущийПользователь));
	Структура.Вставить("order_number"   , Заказ.Номер);
	Структура.Вставить("order_time"   , Заказ.Дата); 


	articles = Новый Массив();
	Для каждого СтрМН Из МассивВерсий Цикл		
		articles.Добавить(СтрМН.Артикул);		
	КонецЦикла;

	Структура.Вставить("articles", СтруктураВJSON(articles)); 	

	recipients = Новый Массив();
	recipients.Добавить(ПолучитьEmail(Дизайнер));
	notification = Новый Структура;
	notification.Вставить("send"      ,1);
	notification.Вставить("text"      ,Комментарий);
	notification.Вставить("recipients",recipients);	

	Структура.Вставить("notification", СтруктураВJSON(notification)); 	


	Возврат СтруктураВJSON(Структура);
		
КонецФункции //-Лико m.shenderov 05.02.2024 


Функция ОтправитьУведомлениеВDFM050224(МассивВерсий, Дизайнер, Заказ, Комментарий) Экспорт 
 Settings=Settings();

	Token=ПолучитьToken();
	Если Не ЗначениеЗаполнено(Token) Тогда
		ВызватьИсключениеПринудительно("token не получен." );
		Возврат Неопределено;  		
	КонецЕсли;


	Структура = Новый Структура;
	Структура.Вставить("author_name"   , ПараметрыСеанса.ТекущийПользователь.Наименование);
	Структура.Вставить("author_mail"   , ПолучитьEmail(ПараметрыСеанса.ТекущийПользователь));
	Структура.Вставить("order_number"   , Заказ.Номер);
	Структура.Вставить("order_time"   , Заказ.Дата); 


	articles = Новый Массив();
	Для каждого СтрМН Из МассивВерсий Цикл		
		articles.Добавить(СтрМН.Артикул);		
	КонецЦикла;

	Структура.Вставить("articles", СтруктураВJSON(articles)); 	

	recipients = Новый Массив();
	recipients.Добавить(ПолучитьEmail(Дизайнер));
	notification = Новый Структура;
	notification.Вставить("send"      ,1);
	notification.Вставить("text"      ,Комментарий);
	notification.Вставить("recipients",recipients);	

	Структура.Вставить("notification", СтруктураВJSON(notification)); 	


	ТелоЗапроса=СтруктураВJSON(Структура);


	ssl = Новый ЗащищенноеСоединениеOpenSSL();


	Попытка		
		//СоединениеHTTP = Новый HTTPСоединение("dfm2.okil.ru",,,,,,ssl); 	
		Массив = Новый Массив();
		Массив.Добавить(Новый Структура("Authorization", СтрШаблон("Bearer %1",Token)));		
        Массив.Добавить(Новый Структура("UserRole", "_service"));

		//HttpRespons=HttpRecuest("dev-dfm.okil.ru","/api/v2/articles/appoint",ТелоЗапроса,ssl,,Массив);
		//HttpRespons=HttpRecuest("dev-dfm.okil.ru","api/v2/nodes/product",ТелоЗапроса,ssl,,Массив);
		HttpRespons=HttpRecuest(Settings.domain,Settings.ApiEndPoint_mail,ТелоЗапроса,ssl,,Массив);
      


		ОтветПотокаJSON = ПолучитьОтветJSON(HttpRespons);		

		Если ОтветПотокаJSON.Свойство("error") Тогда 				
			Возврат  ОтветПотокаJSON.error;
		КонецЕсли;

	Исключение
		Сообщить(ОписаниеОшибки());
		ВызватьИсключение;
		Возврат Неопределено;
	КонецПопытки;	
КонецФункции


Функция СтруктураВJSON(Структура) //+Лико m.shenderov 07.05.2021
	НастройкиСериализациииJSON 							= Новый НастройкиСериализацииJSON;
	НастройкиСериализациииJSON.ВариантЗаписиДаты		= ВариантЗаписиДатыJSON.ЛокальнаяДата;
	НастройкиСериализациииJSON.ФорматСериализацииДаты 	= ФорматДатыJSON.ISO;
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();	
	ЗаписатьJSON(ЗаписьJSON, Структура,НастройкиСериализациииJSON); 	
	ТелоЗапроса = ЗаписьJSON.Закрыть(); 
	 Возврат ТелоЗапроса; 
КонецФункции //-Лико m.shenderov 07.05.2021

Функция ПолучитьEmail(Пользователь) Экспорт  //+Лико m.shenderov 07.05.2021
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПользователиКонтактнаяИнформация.Представление КАК Mail
	|ИЗ
	|	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|ГДЕ
	|	ПользователиКонтактнаяИнформация.Вид = &Вид
	|	И ПользователиКонтактнаяИнформация.Ссылка.Ссылка = &Пользователь";
	
	Запрос.УстановитьПараметр("Вид",Справочники.ВидыКонтактнойИнформации.EmailПользователя);
	Запрос.УстановитьПараметр("Пользователь",Пользователь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка =РезультатЗапроса .Выбрать();
	Пока Выборка.Следующий() Цикл
	       Возврат Выборка.Mail;
	КонецЦикла;
	Возврат "";	
КонецФункции //-Лико m.shenderov 07.05.2021 

Функция ПолучитьОтветJSON(HTTPОтвет) //+Лико m.shenderov 07.05.2021
		ПотокОтветаJSON  = HTTPОтвет.ПолучитьТелоКакПоток();
		ЧтениеПотокаJSON = Новый ЧтениеJSON;
		ЧтениеПотокаJSON.ОткрытьПоток(ПотокОтветаJSON, КодировкаТекста.UTF8);
		Результат=ПрочитатьJSON(ЧтениеПотокаJSON);
		ЧтениеПотокаJSON.Закрыть();
		Возврат Результат; 
КонецФункции //-Лико m.shenderov 07.05.2021 

Функция HttpRecuest(host,slug,json,ssl=Неопределено,port="",header="") //+Лико m.shenderov 07.05.2021
	
	СоединениеHTTP=Неопределено;	
	СтрКоманда=СтрШаблон("СоединениеHTTP = новый HTTPСоединение(%1,%2,,,,,%3)",
   "host",
	port,
	?(ssl=Неопределено,"","ssl"));
	Выполнить(СтрКоманда); 	
		
		HTTPЗапрос = Новый HTTPЗапрос(slug);
		HTTPЗапрос.Заголовки.Вставить("Content-type", "application/json; charset=utf-8");
		Если ТипЗнч(header)=Тип("Массив") Тогда
			 Для каждого Структура Из header Цикл 			
				   Для каждого Ключ Из  Структура Цикл
				   	     HTTPЗапрос.Заголовки.Вставить(Ключ.Ключ, Ключ.Значение);
				   КонецЦикла;
			   КонецЦикла;
		КонецЕсли;	   
		HTTPЗапрос.УстановитьТелоИзСтроки(json);		
	 Возврат СоединениеHTTP.ОтправитьДляОбработки(HTTPЗапрос);
КонецФункции //-Лико m.shenderov 07.05.2021 

Функция ЕстьВерсияНоменклатуры(Номенклатура) Экспорт //+Лико m.shenderov 26.04.2021
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ВерсииНоменклатуры.Версия КАК Версия
	|ИЗ
	|	Справочник.Лико_ВерсииНоменклатуры КАК Лико_ВерсииНоменклатуры
	|ГДЕ
	|	Лико_ВерсииНоменклатуры.Номенклатура = &Номенклатура
	|	И НЕ Лико_ВерсииНоменклатуры.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Версия УБЫВ";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Возврат Истина;		
	КонецЦикла; 	
	Возврат Ложь;	
КонецФункции //-Лико m.shenderov 26.04.2021 

Функция НайтиВерсиюНоменклатуры(Номенклатура,Версия) Экспорт //+Лико m.shenderov 26.04.2021
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ВерсииНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Лико_ВерсииНоменклатуры КАК Лико_ВерсииНоменклатуры
	|ГДЕ
	|	Лико_ВерсииНоменклатуры.Номенклатура = &Номенклатура
	|	И НЕ Лико_ВерсииНоменклатуры.ПометкаУдаления
	|	И Лико_ВерсииНоменклатуры.Версия = &Версия";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура );
	Запрос.УстановитьПараметр("Версия",Версия);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Возврат Выборка.Ссылка;		
	КонецЦикла; 	
	
КонецФункции //-Лико m.shenderov 26.04.2021 

Функция НайтиВерсиюНоменклатуры22012024(Номенклатура,Версия,Технология) Экспорт //+Лико m.shenderov 26.04.2021
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ВерсииНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Лико_ВерсииНоменклатуры КАК Лико_ВерсииНоменклатуры
	|ГДЕ
	|	Лико_ВерсииНоменклатуры.Номенклатура = &Номенклатура
	|	И НЕ Лико_ВерсииНоменклатуры.ПометкаУдаления
	|	И Лико_ВерсииНоменклатуры.Версия = &Версия
	|	И Лико_ВерсииНоменклатуры.ТехнологияПечати = &Технология";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура );
	Запрос.УстановитьПараметр("Технология",Технология );
	Запрос.УстановитьПараметр("Версия",Версия);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Возврат Выборка.Ссылка;		
	КонецЦикла; 	
	
КонецФункции //-Лико m.shenderov 26.04.2021 


Функция НайтиМаксВерсиюНоменклатуры(Номенклатура,Технология) Экспорт //+Лико m.shenderov 26.04.2021
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ВерсииНоменклатуры.Ссылка КАК Ссылка,
	|	Лико_ВерсииНоменклатуры.Версия КАК Версия
	|ИЗ
	|	Справочник.Лико_ВерсииНоменклатуры КАК Лико_ВерсииНоменклатуры
	|ГДЕ
	|	Лико_ВерсииНоменклатуры.Номенклатура = &Номенклатура
	|	И НЕ Лико_ВерсииНоменклатуры.ПометкаУдаления
	|	И Лико_ВерсииНоменклатуры.ТехнологияПечати = &Технология
	|
	|УПОРЯДОЧИТЬ ПО
	|	Версия УБЫВ";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура );
	Запрос.УстановитьПараметр("Технология",Технология );
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Возврат Выборка.Ссылка;		
	КонецЦикла; 	
	
КонецФункции //-Лико m.shenderov 26.04.2021 

Функция НайтиНоменклатуруКлиента(НаименованиеНоменклатуры,Клиент) Экспорт  //+Лико m.shenderov 18.05.2021

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураДополнительныеРеквизиты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|ГДЕ
	|	НоменклатураДополнительныеРеквизиты.Ссылка.Наименование = &НаименованиеНоменклатуры
	|	И НоменклатураДополнительныеРеквизиты.Значение = &Клиент
	|	И НоменклатураДополнительныеРеквизиты.Свойство.Имя = ""Партнер""";
	Запрос.УстановитьПараметр("НаименованиеНоменклатуры",НаименованиеНоменклатуры );
	Запрос.УстановитьПараметр("Клиент",Клиент );

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Возврат Выборка.Ссылка;
	
	КонецЦикла; 
	
	

		
КонецФункции //-Лико m.shenderov 18.05.2021

Функция ВызватьИсключениеПринудительно(Текст) //+Лико m.shenderov 01.06.2021

	Попытка
		ф=1/0;
	Исключение
		ВызватьИсключение Текст; 
	КонецПопытки;
		

КонецФункции //-Лико m.shenderov 01.06.2021 

Процедура ОтправитьУведомлениеИТDFM(Структура) //+Лико m.shenderov 19.07.2021
	Текст =  СтрШаблон("DFM. У пользвателя: %1 не заполнена почта в 1С.",Структура.author_name);
	Тема  = Текст;
	
	Для Каждого Элемент из Структура Цикл 
		Текст=Текст+Символы.ПС+Символы.ВК;
		Текст=Текст+Элемент.Ключ + ": " + Элемент.Значение; 
	КонецЦикла;
	
	
	ТипСообщения=Справочники.Лико_ТипыСообщений.УведомленияИТDFM;
	
	Адресат = Справочники.Лико_ТипыСообщений.ПолучитьПочтовыеАдреса(ТипСообщения,Справочники.Организации.ПустаяСсылка()); 		
	
	
	#Если ВнешнееСоединение Тогда
		
	#Иначе 		
		Лико_Планирование.ОтправитьПисьмо(текст, Тема, Адресат,,"textBody");		
	#КонецЕсли
	
	
КонецПроцедуры //-Лико m.shenderov 19.07.2021

Функция ОтправитьУведомлениеВDFMДекоратор(МассивВерсий, Дизайнер, Заказ, Комментарий) Экспорт
 Возврат ОтправитьУведомлениеВDFM(МассивВерсий, Дизайнер, Заказ, Комментарий);
КонецФункции

Функция ОтправитьИзмененноеНаименованиеDFM(Номенклатура,Наименование)  Экспорт 

	Возврат РегистрацияИзменененияНаименованиеDFM(Номенклатура,Наименование); 
	
	Settings=Settings();

	Token=ПолучитьToken();
	Если Не ЗначениеЗаполнено(Token) Тогда
		ВызватьИсключениеПринудительно("token не получен." );
		Возврат Неопределено;  		
	КонецЕсли;


	Структура = Новый Структура;
	Структура.Вставить("op","rename");
	Структура.Вставить("article",Номенклатура.Артикул);
	Структура.Вставить("name",Наименование);  	
	ТелоЗапроса=СтруктураВJSON(Структура);

	ssl = Новый ЗащищенноеСоединениеOpenSSL();


	Попытка		
		//СоединениеHTTP = Новый HTTPСоединение("dfm2.okil.ru",,,,,,ssl); 	
		Массив          = Новый Массив();
		Массив.Добавить(Новый Структура("Authorization", СтрШаблон("Bearer %1",Token)));
		Массив.Добавить(Новый Структура("UserRole", "_service"));

		HttpRespons     = HttpRecuest(Settings.domain,Settings.rename,ТелоЗапроса,ssl,,Массив);
      		
       
	Исключение
		Сообщить(ОписаниеОшибки());
		ВызватьИсключение;
		Возврат Неопределено;
	КонецПопытки;	
КонецФункции

Функция РегистрацияИзменененияНаименованиеDFM(Номенклатура,Наименование) Экспорт  //+Лико m.shenderov 07.05.2021
	

	Структура = Новый Структура;
	Структура.Вставить("op","rename");
	Структура.Вставить("article",Номенклатура.Артикул);
	Структура.Вставить("name",Наименование);  	
	
	DataJson=СтруктураВJSON(Структура);

	Возврат РегистрыСведений.Лико_РегистрацияОперацийДляОбмена.ДобавитьСобытие(,"ИзменитьНаименование", DataJson);
	
    
КонецФункции //-Лико m.shenderov 07.05.2021 


Функция ПолучитьВерсии(Номенклатура) Экспорт //+Лико m.shenderov 23.01.2024
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Лико_ВерсииНоменклатуры.Ссылка КАК ВерсияНоменклатуры,
	|	Лико_ВерсииНоменклатуры.Артикул КАК Артикул,
	|	Лико_ВерсииНоменклатуры.Версия КАК Версия,
	|	ЗаказКлиентаТовары.Ссылка КАК ЗаказКлиента,
	|	ЗаказКлиентаТовары.Ссылка.НомерБезПрефикса КАК НомерЗаказа,
	|	ЗаказКлиентаТовары.Ссылка.Дата КАК ДатаЗаказа
	|ИЗ
	|	Справочник.Лико_ВерсииНоменклатуры КАК Лико_ВерсииНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ПО ЗаказКлиентаТовары.ВерсияНоменклатуры = Лико_ВерсииНоменклатуры.Ссылка
	|ГДЕ
	|	Лико_ВерсииНоменклатуры.Номенклатура = &Номенклатура
	|	И НЕ Лико_ВерсииНоменклатуры.ПометкаУдаления";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура );
	Возврат  Запрос.Выполнить().Выгрузить();
	
	
	
КонецФункции //-Лико m.shenderov 23.01.2024
